tap "hashicorp/tap"
tap "homebrew/bundle"
tap "jakehilborn/jakehilborn"
# Anti-virus software
brew "clamav"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Open-source GitLab command-line tool
brew "glab"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Terraform
brew "hashicorp/tap/terraform"
# macOS command line utility to configure multi-display resolutions and arrangements. Essentially XRandR for macOS.
brew "jakehilborn/jakehilborn/displayplacer"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Utilities designed to make common development tasks easier
cask "devtoys"
vscode "4ops.terraform"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "gruntfuggly.todo-tree"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "octref.vetur"
vscode "ritwickdey.liveserver"
